---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonShearAreaWeakAxis
source: html/38ef36eb-4a0b-a3fd-df30-8acc80e0392e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonShearAreaWeakAxis Property

"Shear Area weak axis"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonShearAreaWeakAxis { get; }
```